from books_sdk import get_book_by_id, get_author

print(get_author(get_book_by_id('AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM', '1' )))

# Гипотеза 1: Неправильные скобки
# Способ проверки: методом клика пройтись по какой скобке
# Установленный факт: все скобки закрыты
# Вывод: проблема не в скобках

# Гипотеза 2: Ошибка во вложенной функции
# Способ проверки: Запустить вложенную функцию отдельно от внешней
# Код для проверки: get_book_by_id('1', 'AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM')
# Установленный факт: ошибка не изменилась
# Вывод: ошибка в этой функции или аргументе

# Гипотеза 3: Проблема в типе данных, '1' должно быть числом
# Способ проверки: удаление кавычек
# Код для проверки: print(get_author(get_book_by_id(1, 'AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM')))
# Установленный факт: ошибка не изменилась
# Вывод: проблема не в кавычках

# Гипотеза 4: перепутаны местами позиционные аргументы
# Способ проверки: изменение порядка аргументов
# Код для проверки: print(get_author(get_book_by_id('AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM', '1' )))
# Установленный факт: код работает
# Вывод: проблема устранена

# Гипотеза 5: ...
# Способ проверки: ...
# Код для проверки: ...
# Установленный факт: ...
# Вывод: ...